local export = {}

local conv = {
    ["क"] = "𑂍",
    ["ख"] = "𑂎",
    ["ग"] = "𑂏",
    ["घ"] = "𑂐",
    ["ङ"] = "𑂑",
    ["च"] = "𑂒",
    ["छ"] = "𑂓",
    ["ज"] = "𑂔",
    ["झ"] = "𑂕",
    ["ञ"] = "𑂖",
    ["ट"] = "𑂗",
    ["ठ"] = "𑂘",
    ["ड"] = "𑂙",
    ["ढ"] = "𑂛",
    ["ण"] = "𑂝",
    ["त"] = "𑂞",
    ["थ"] = "𑂟",
    ["द"] = "𑂠",
    ["ध"] = "𑂡",
    ["न"] = "𑂢",
    ["प"] = "𑂣",
    ["फ"] = "𑂤",
    ["ब"] = "𑂥",
    ["भ"] = "𑂦",
    ["म"] = "𑂧",
    ["य"] = "𑂨",
    ["र"] = "𑂩",
    ["ल"] = "𑂪",
    ["व"] = "𑂫",
    ["श"] = "𑂬",
    ["ष"] = "𑂭",
    ["स"] = "𑂮",
    ["ह"] = "𑂯",

    ["ा"] = "𑂰",
    ["ि"] = "𑂱",
    ["ी"] = "𑂲",
    ["ु"] = "𑂳",
    ["ू"] = "𑂴",
    ["े"] = "𑂵",
    ["ै"] = "𑂶",
    ["ो"] = "𑂷",
    ["ौ"] = "𑂸",
    ["्"] = "𑂹",
    ["़"] = "𑂺",

    -- vowels
    ["अ"] = "𑂃",
    ["आ"] = "𑂄",
    ["इ"] = "𑂅",
    ["ई"] = "𑂆",
    ["उ"] = "𑂇",
    ["ऊ"] = "𑂈",
    ["ऋ"] = "𑂩𑂲",
    ["ए"] = "𑂉",
    ["ऐ"] = "𑂊",
    ["ओ"] = "𑂋",
    ["औ"] = "𑂌",
    -- chandrabindu    
    ["ँ"] = "𑂀",
    -- anusvara    
    ["ं"] = "𑂁",
    -- visarga    
    ["ः"] = "𑂂",
    -- punctuation        
    ["॥"] = "𑃁",
    ["।"] = "𑃀"
}

function export.tr(text, lang, sc)
    text = mw.ustring.gsub(text, ".", function(c) return conv[c] end)

    return text
end

return export
