local export = {}
 
local chars = {
	["𐊀"] = "a",
	["𐊂"] = "b",
	["𐊄"] = "g",
	["𐊅"] = "d",
	["𐊆"] = "i",
	["𐊇"] = "w",
	["𐊈"] = "z",
	["𐊛"] = "h",
	["𐊉"] = "θ",
	["𐊊"] = "j",
	["𐊋"] = "k",
	["𐊍"] = "l",
	["𐊎"] = "m",
	["𐊏"] = "n",
	["𐊒"] = "u",
	["𐊓"] = "p",
	["𐊔"] = "k",
	["𐊕"] = "r",
	["𐊖"] = "s",
	["𐊗"] = "t",
	["𐊁"] = "e",
	["𐊙"] = "ã",
	["𐊚"] = "ẽ",
	["𐊐"] = "m̃",
	["𐊑"] = "ñ",
	["𐊘"] = "τ",
	["𐊌"] = "q",
	["𐊃"] = "β",
	["𐊜"] = "χ",
}

function export.tr(text, lang, sc)
	return (mw.ustring.gsub(text, '.', chars))
end

return export